[
  {
    "id": "business-site",
    "title": "Business site",
    "summary": "A fictional responsive website built with HTML, CSS & JavaScript. Includes hero video, card-based layout, signup form, and interactive hamburger menu. No backend connection — focus on responsive UI and clean code.",
    "tags": [
      "HTML",
      "CSS",
      "JavaScript"
    ],
    "live": "https://frontendproject2025.netlify.app/",
    "code": "https://github.com/JeffieJansson/frontend-project",
    "image": {
      "src": "/business1.png",
      "alt": "picture of record studio website"
    }
  },
  {
    "id": "recipe",
    "title": "Recipe library",
    "summary": "An interactive recipe web app with possibility to search, filter and sort recipes by cuisine, diet, time and popularity using Spoonacular API. Data normalized and cached in localStorage for better performance and offline access",
    "tags": [
      "HTML",
      "CSS",
      "JavaScript",
      "Spoonacular API"
    ],
    "live": "https://library-recipe.netlify.app/",
    "code": "https://github.com/JeffieJansson/recipe-library",
    "image": {
      "src": "/recipe.png",
      "alt": "pictures of food recipes and filtering options"
    }
  },
  {
    "id": "weather",
    "title": "Weather app – SMHI API",
    "summary": "A responsive weather app displaying current weather conditions and 5-day forecasts for multiple Swedish cities using the SMHI API. Built collaboratively using Git and TypeScript for safer data handling and cleaner code.",
    "tags": [
      "HTML",
      "CSS",
      "TypeScript",
      "SMHI API"
    ],
    "live": "https://project-weather-app-b2.netlify.app/",
    "code": "https://github.com/marinalendt-png/js-project-weather-app",
    "image": {
      "src": "/weather.png",
      "alt": "picture of weather app"
    }
  },
  {
    "id": "accessibility",
    "title": "Build a Quiz with Web Accessibility in mind",
    "summary": "A responsive Quiz build with web accessibility in mind. The quiz tests users' knowledge of the team that built the website through multiple-choice questions. It provides instant feedback on answers and a final score at the end. As a second page reveals information about the team and answers to the quiz questions.",
    "tags": [
      "HTML",
      "CSS",
      "JavaScript"
    ],
    "live": "https://accessibilitymixedgroup.netlify.app/",
    "code": "https://github.com/irisdgz/js-project-accessibility",
    "image": {
      "src": "/quiz.png",
      "alt": "Picture of web accessibility quiz results"
    }
  },
  {
    "id": "happy thoughts",
    "title": "Happy Thoughts - Fullstack Twitter-inspired App",
    "summary": " is a Twitter-inspired fullstack application where users can share positive messages, like others’ thoughts, and manage their own posts. The project features a custom Express/MongoDB backend with schema validation, authentication, and a RESTful API, fully integrated with a modern React frontend. Users can sign up or log in to access protected features such as posting, editing, and deleting their own thoughts, with all communication secured by token-based authorization. Both frontend and backend provide real-time validation and error handling, ensuring a seamless and secure user experience. The app is fully responsive, accessible, and demonstrates clean code architecture with separation of concerns, DRY principles, and well-documented, maintainable code.",
    "tags": [
      "React",
      "JavaScript",
      "CSS",
      "API",
      "Vite",
      "react-timeago",
      "MongoDB",
      "Express",
      "Node.js"
    ],
    "live": "https://jennifer-happy-thoughts.netlify.app/",
    "code": "https://github.com/JeffieJansson/happy-thoughts",
    "image": {
      "src": "/happy-t.png",
      "alt": "Picture of happy thoughts app"
    }
  },
  {
    "id": "movie-app",
    "title": "Movie App - React & TMDB API",
    "summary": "A React-based movie discovery application that fetches and displays popular movies using The Movie Database (TMDB) API. Users can browse a responsive grid of movie posters and click to view detailed information about each film.",
    "tags": [
      "React",
      "JavaScript",
      "CSS",
      "TMDB API",
      "Vite"
    ],
    "live": "https://browseflix.netlify.app/",
    "code": "https://github.com/sandrahagevall/js-project-movies/tree/main",
    "image": {
      "src": "/movies.png",
      "alt": "Picture of movie app"
    }
  },
  {
    "id": "todo-app",
    "title": "Todo App - Zustand State Management",
    "summary": "A clean and responsive todo application built with React and Zustand for global state management. Users can add, remove, and toggle tasks between completed and uncompleted states. Features task counts, friendly empty states and full accessibility",
    "tags": [
      "React",
      "Zustand",
      "JavaScript",
      "CSS",
      "Vite",
      "State Management"
    ],
    "live": "https://jeffie-todo-app.netlify.app/",
    "code": "https://github.com/JeffieJansson/todo",
    "image": {
      "src": "/todo1.png",
      "alt": "Picture of todo app with task list and completion tracking"
    }
  }
]